#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	char	ch1 = 'A'; //char : 1바이트 문자형 자료형이며 -128부터 127까지의 정수에 해당되는 문자를 저장가능 변수 선언시 char 변수명 으로 선언
	char	ch2 = 'B'; // 문자형 변수에 글자를 지정할 경우에는 반드시 따옴표(' ')를 사용하여야 한다
	char	ch3 = 'C'; // c언어에서 변수 선언함과 동시에 변수값을 대입하는 것이 가능하다.
 	// = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a에 10을 대입
	printf("첫 번째 문자 = %c, %d\n", ch1, ch1); //%c : 문자형 형식지정문자이며 1글자의 문자를 출력할 때 사용한다
	printf("두 번째 문자 = %c, %d\n", ch2, ch2); //%d : 정수형 형식지정문자이며 부호 있는 10진수 형태의 숫자를 출력할 때 사용한다
	printf("세 번째 문자 = %c, %d\n", ch3, ch3); //변수가 문자형으로 선언됬으므로 출력시 문자명에 해당되는 ASCII 코드값이 출력된다
}//printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다
 //\n : 줄을 바꾸는 제어문자
