#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	int age, height, muge; //int : 4바이트 정수형을 처리하기 위한 자료형이며 -214783648부터 2147483647까지 정수를 저장가능 변수 선언시 int 변수명 과 같이 선언한다
	double j, k; //double : 4바이트 실수형 자료형이며 ±1.7*10^-306부터 ±1.7*10^306까지 실수를 저장가능 표현시 오차발생가능 변수 선언시 double 변수명 으로 선언
	char p = 'A'; //char : 1바이트 문자형 자료형이며 -128부터 127까지의 정수에 해당되는 문자를 저장가능 
	// 문자형 변수에 글자를 지정할 경우에는 반드시 따옴표(' ')를 사용하여야 한다
	age = 20; // = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a에 10을 대입
	height = 180; 
	muge = 70;

	j = 3.5;
	k = 0.72825;

	printf("나이는 %d 키는 %d 몸무게는 %d 입니다\n", age, height, muge); //%d : 정수형 형식지정문자이며 부호 있는 10진수 형태의 숫자를 출력할 때 사용한다
	printf("실수형 데이터 %f 와 %f 그리고 문자 %c\n", j, k, p);//%c : 문자형 형식지정문자이며 1글자의 문자를 출력할 때 사용한다, \n : 줄을 바꾸는 제어문자
} //%f : 부동소수점형형 형식지정문자이며 소수점이 있는 실수 형태의 숫자를 출력할 때 사용한다 
  //printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다
