#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	float a = 3.14; //float : 4바이트 실수형 자료형이며 ±3.4*10^-38부터 ±3.4*10^38까지 실수를 저장가능 표현시 오차발생가능 변수 선언시 float 변수명 으로 선언
	double b = 0.0002754; //double : 4바이트 실수형 자료형이며 ±1.7*10^-306부터 ±1.7*10^306까지 실수를 저장가능 표현시 오차발생가능 변수 선언시 double 변수명 으로 선언

	printf("a의 값은 소수형태로 %2.2f 지수 형태로 %2.2e\n", a, a); //%N.Mf : 자리수를 지정한 부동소수점형형 형식지정문자이며 데이터를 실수 형태로 N.M칸에 맞추어 출력한다는 의미이다
	printf("b의 값은 소수형태로 %2.5f 지수 형태로 %2.2e\n", b, b); //%N.Me : 자리수를 지정한 부동소수점형형 형식지정문자이며 데이터를 지수 형태로 N.M칸에 맞추어 출력한다는 의미이다
} //printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다
  //\n : 줄을 바꾸는 제어문자