#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	int		n; //int : 4바이트 정수형을 처리하기 위한 자료형이며 -214783648부터 2147483647까지 정수를 저장가능 변수 선언시 int 변수명 과 같이 선언
	
	for (n = 0; n < 5; n++) // for문 : 반복 제어문이며 for(초기화식; 조건식; 증감식;) 으로 구성 
	{// 초기화식 : for 문 실행될 때 처음에 한번만 실행, 조건식 : 거짓일 시 실행문 블록 미실행 후 다음 코드 실행 참일 시 실행문 블록 실행 및 증감식 실행
		printf("%d번쨰 반복문입니다\n", n+1); //printf() : 프로그램에서 모니터를 통하여 글자를 출력하는 기능을 제공함, \n : 줄을 바꾸는 제어문자
	} // ++: 증감연산자이며 a++의 뜻은 실행문을 실행한 후에 a의 값을 1 증가하라는 의미이다.
}  // < :  관계연산자이며 a < b의 뜻은 b가 a보다 크면 참이라는 의미이다.
// = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a는 10이다
// + : 산술연산자이며 c = a + b의 뜻은 a와 b의 값을 더한 결과를  c에 저장하라는 의미이다.
