#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	char a, b, c; //char : 1바이트 문자형 자료형이며 -128부터 127까지의 정수에 해당되는 문자를 저장가능
	a = 'A'; // 문자형 변수에 글자를 지정할 경우에는 반드시 따옴표(' ')를 사용하여야 한다
	b = 'a'; // = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a에 10을 대입
	c = 'z';

	printf("문자형 변수에 저장된 값은 %c %c %c 입니다.\n,a ,b ,c"); //%c : 문자형 형식지정문자이며 1글자의 문자를 출력할 때 사용한다
} //printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다
