#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{	
	float a = 3.14; //float : 4바이트 실수형 자료형이며 ±3.4*10^-38부터 ±3.4*10^38까지 실수를 저장가능 표현시 오차발생가능 변수 선언시 float 변수명 으로 선언
	double b = 0.0002754; //double : 4바이트 실수형 자료형이며 ±1.7*10^-306부터 ±1.7*10^306까지 실수를 저장가능 표현시 오차발생가능 변수 선언시 double 변수명 으로 선언
	// = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a에 10을 대입
	printf("a의 값은 소수형태로 %f 지수 형태로 %e\n", a, a); //%f : 부동소수점형형 형식지정문자이며 소수점이 있는 실수 형태의 숫자를 출력할 때 사용한다
	printf("b의 값은 소수형태로 %f 지수 형태로 %e\n", b, b); //%e : 부동소수점형형 형식지정문자이며 지수 형태의 숫자를 출력할 때 사용한다
}//printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다
 //\n : 줄을 바꾸는 제어문자
