#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	int		k; //int : 4바이트 정수형을 처리하기 위한 자료형이며 -214783648부터 2147483647까지 정수를 저장가능 변수 선언시 int 변수명 과 같이 선언한다

	k = 172; // = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a에 10을 대입

	printf("10진수 %d의 8진수는 %o, 16진수는 %x %x입니다\n", k, k, k, k); //%d : 정수형 형식지정문자이며 부호 있는 10진수 형태의 숫자를 출력할 때 사용한다
} //%o : 정수형 형식지정문자이며 8진수 형태의 숫자를 출력할 때 사용한다
  //%x : 정수형 형식지정문자이며 16진수 형태의 숫자를 출력할 때 사용한다 (10 이상 숫자 ex) abcdef는 소문자로 표기
  //%X : 정수형 형식지정문자이며 16진수 형태의 숫자를 출력할 때 사용한다 (10 이상 숫자 ex) ABCDEF는 대문자로 표기
  //\n : 줄을 바꾸는 제어문자
  //printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다