#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	int		num; //int : 4바이트 정수형을 처리하기 위한 자료형이며 -214783648부터 2147483647까지 정수를 저장가능 변수 선언시 int 변수명 과 같이 선언
	int		dan;

	for (dan = 2; dan <= 9; dan++) // for문 : 반복 제어문이며 for(초기화식; 조건식; 증감식;) 으로 구성 
	{// 초기화식 : for 문 실행될 때 처음에 한번만 실행, 조건식 : 거짓일 시 실행문 블록 미실행 후 다음 코드 실행 참일 시 실행문 블록 실행 및 증감식 실행
		printf("\n구구단 %d단 입니다\n", dan); //printf() : 프로그램에서 모니터를 통하여 글자를 출력하는 기능을 제공함

		for (num = 1; num < 10; num++)
		{
			printf("%d x %d = %d", num, dan * num); //printf() : 프로그램에서 모니터를 통하여 글자를 출력하는 기능을 제공함 
			// * : 산술연산자이며 c = a * b의 뜻은 a와 b의 값을 곱한 결과를  c에 저장하라는 의미이다.
			if (num % 3 == 0) //if-else문 : if문 ()내 주어진 조건식을 판단하여 참일 경우에 실행할 실행문과 거짓일 경우  실행할 실행문을 설정가능 if (조건식) {실행문;} else {실행문}으로 사용
				printf("\n"); //\n : 줄을 바꾸는 제어문자
			else
				printf("\t"); //\t : Tab 키와 동일한 기능을 하는 제어문자
		}
	printf("\n");
	} // ++: 증감연산자이며 a++의 뜻은 실행문을 실행한 후에 a의 값을 1 증가하라는 의미이다.
} //%d : 정수형 형식지정문자이며 부호 있는 10진수 형태의 숫자를 출력할 때 사용한다
	

