#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{

	int		k; //int : 4바이트 정수형을 처리하기 위한 자료형이며 -214783648부터 2147483647까지 정수를 저장가능 변수 선언시 int 변수명 과 같이 선언
	
	k = 172; // = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a에 10을 대입

	printf("10진수 %5d 의 8진수는 %5o, 16진수는 %5x 입니다\n ", k, k, k); //%Nd 자리수를 지정한 10진수 정수 데이터 형식 지정 문자이며 정수 데이터를  10진수 형태로 N칸에 맞추어 출력한다는 의미이다
} //%No 자리수를 지정한 8진수 정수 데이터 형식 지정 문자이며 정수 데이터를  8진수 형태로 N칸에 맞추어 출력한다는 의미이다
  //%Nx 자리수를 지정한 16진수 정수 데이터 형식 지정 문자이며 정수 데이터를  16진수 형태로 N칸에 맞추어 출력한다는 의미이다
 //\n : 줄을 바꾸는 제어문자
  //printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다