#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	int a1, a2, a3, a4; //int : 4바이트 정수형을 처리하기 위한 자료형이며 -214783648부터 2147483647까지 정수를 저장가능 변수 선언시 int 변수명 과 같이 선언
	int b1, b2, b3, b4;

	a1 = a2 = a3 = a4 = 10; // = :  단순대입 연산자이며 = 왼쪽의 변수에 오른쪽의 값을 대입할 때 사용 Ex) a = 10 -> a는 10이다
	b1 = b2 = b3 = b4 = 5; 

	printf("a1=a2=a3=a4=%d, b1=b2=b3=b4=%d 입니다\n", a1, b1); //printf() : 프로그램에서 모니터를 통하여 글자를 출력하는 기능을 제공함, \n : 줄을 바꾸는 제어문자
	//printf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " " 뒤에 ,로 구분하여 지정한다 변수와 형식지정문자는 1대 1로 매핑된다
	a1 += b1; // += : 복합대입연산자이며 a += b의 뜻은 a에 a와 b를 더한 결과를 a에 저장하라는 의미이다.
	a2 -= b2; // -= : 복합대입연산자이며 a -= b의 뜻은 a에 a와 b를 뺀 결과를 a에 저장하라는 의미이다.
	a3 *= b3; // *= : 복합대입연산자이며 a *= b의 뜻은 a에 a와 b를 곱한 결과를 a에 저장하라는 의미이다.
	a4 /= b4; // /= : 복합대입연산자이며 a /= b의 뜻은 a에 a와 b를 나눈 결과를 a에 저장하라는 의미이다.
	prinft("a1 += b1 의 값은 %d 입니다\n", a1); //%d : 정수형 형식지정문자이며 부호 있는 10진수 형태의 숫자를 출력할 때 사용한다
	prinft("a2 -= b2 의 값은 %d 입니다\n", a2);
	prinft("a3 *= b3 의 값은 %d 입니다\n", a3);
	prinft("a4 /= b4 의 값은 %d 입니다\n", a4);
}