#include <stdio.h>//#include <> 해더파일이며 외부의 변수 함수 소스코드 사용을 위해서 사용, stdio.h: 표준입출력함수
void main() //void : return값 없는 자료형 함수 main() : C언어 시작시 가장 먼저 호출되는 함수
{
	int		num; //int : 4바이트 정수형을 처리하기 위한 자료형이며 -214783648부터 2147483647까지 정수를 저장가능 변수 선언시 int 변수명 과 같이 선언
	printf("1~3 사이의 숫자를 입력하세요: ");
	scanf("%d", &num); // scanf: 표준입력함수이며 키보드를 통해서 데이터를 입력하는 기능을 제공한다 & 변수는 메모리 공간에서의 변수에 대한 주소를 구하기 위해 변수명 앞에 반드시 선언해야 한다
	//사용시 scanf 함수 내 " " 안의 출력할 문자열에 형식지정문자 (Ex:%d)를 삽입하고 변수명은 " "안의 형식지정문자 뒤에 ,&변수명으로 지정한다 변수와 형식지정문자는 1대 1로 매핑된다
	switch (num) // switch : 프로그램에서 처리할 조건이 여러개이며 각 조건에 따라 실행해야 할 실행문이 각각 별도로 존재하는 경우에 사용된다 switch, case 레이블, 실행문, break문으로 구성
	{
	case 1: //switch 문의 값의 경우를 표기하는 레이블
		printf("숫자 1을 입력하셨습니다.\n"); //printf() : 프로그램에서 모니터를 통하여 글자를 출력하는 기능을 제공함, \n : 줄을 바꾸는 제어문자
		break; // break : switch, while, for문에서 빠져나오는 기능을 수행 혹은 switch 문의 괄호에서 빠져나오는 기능을 수행
	case 2:
		printf("숫자 2을 입력하셨습니다.\n");
		break;
	case 3:
		printf("숫자 3을 입력하셨습니다.\n");
		break;
	default:// default : switch문 내 괄호의 어떠한 case문에도 적용되지 않을시 밑의 실행문을 실행
		printf("1~3 사이의 숫자가 아닌 다른 수가 입력되었습니다,\n");
	} //%d : 정수형 형식지정문자이며 부호 있는 10진수 형태의 숫자를 출력할 때 사용한다
}